@whites11, thanks for your attention. Unfortunately, after upgrading I see no difference in behavior.

If any of backup_configuration, max_replica_memory_gb, or min_replica_memory_gb are not explicitly configured, I always get this plan for the service:

```
  # module.clickhouse_cloud.clickhouse_service.this["analytics"] will be updated in-place
  ~ resource "clickhouse_service" "this" {
      ~ backup_configuration        = {
          ~ backup_period_in_hours           = 24 -> (known after apply)
          ~ backup_retention_period_in_hours = 24 -> (known after apply)
          + backup_start_time                = (known after apply)
        } -> (known after apply)
        id                          = "69bafda1-fd3d-47ad-be47-61813b7c3ce6"
      ~ max_replica_memory_gb       = 8 -> (known after apply)
      ~ min_replica_memory_gb       = 8 -> (known after apply)
        name                        = "analytics-dev"
        # (15 unchanged attributes hidden)
    }
```